---
kind: property
id: P:Autodesk.Revit.DB.ReferenceArray.IsEmpty
source: html/7e8781f8-2045-fccd-bc0a-0bef848f7732.htm
---
# Autodesk.Revit.DB.ReferenceArray.IsEmpty Property

Test to see if the array is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the array is empty then True will be returned, otherwise False.